## IT2313 - Programming for Data Science
## Practical 5 - Question 12 to 15
## Data Manipulation with Pandas (Part 1)

### In this lesson, we will continue to practise our Pandas knowledge. 
- Importing Data into Pandas
- Changing the Values in DataFrame
- DataFrameData Exploration, Sorting and Filtering
- Slicing and Subsetting with .loc and .iloc
- Aggregating Methods

#### We need to import the neccessary libraries

In [1]:
import numpy as np
import pandas as pd

## **Q12 - Let import dataset from "homelessness.csv" into DataFrame known as homelessness**

**(a) Display the full DataFrame after importing from Dataset, do you think it is flessibe to display the full DataFrame?**

In [39]:
# Type your Q12(a) answer here
homelessness=pd.read_csv("homelessness.csv")
homelessness=pd.DataFrame(homelessness)
homelessness.head()

,Unnamed: 0,region,state,individuals,family_members,state_pop
0,0,East South Central,Alabama,2570.0,864.0,4887681
1,1,Pacific,Alaska,1434.0,582.0,735139
2,2,Mountain,Arizona,7259.0,2606.0,7158024
3,3,West South Central,Arkansas,2280.0,432.0,3009733
4,4,Pacific,California,109008.0,20964.0,39461588

**(b) Display the top 10 and bottom 10 rows of the DataFrame**

In [19]:
# Type your Q12(b) answer here
homelessness.head(10)

,Unnamed: 0,region,state,individuals,family_members,state_pop
0,0,East South Central,Alabama,2570.0,864.0,4887681
1,1,Pacific,Alaska,1434.0,582.0,735139
2,2,Mountain,Arizona,7259.0,2606.0,7158024
3,3,West South Central,Arkansas,2280.0,432.0,3009733
4,4,Pacific,California,109008.0,20964.0,39461588
5,5,Mountain,Colorado,7607.0,3250.0,5691287
6,6,New England,Connecticut,2280.0,1696.0,3571520
7,7,South Atlantic,Delaware,708.0,374.0,965479
8,8,South Atlantic,District of Columbia,3770.0,3134.0,701547
9,9,South Atlantic,Florida,21443.0,9587.0,21244317

In [20]:
# Type your Q12(b) answer here
homelessness.tail(10)

,Unnamed: 0,region,state,individuals,family_members,state_pop
41,41,West North Central,South Dakota,836.0,323.0,878698
42,42,East South Central,Tennessee,6139.0,1744.0,6771631
43,43,West South Central,Texas,19199.0,6111.0,28628666
44,44,Mountain,Utah,1904.0,972.0,3153550
45,45,New England,Vermont,780.0,511.0,624358
46,46,South Atlantic,Virginia,3928.0,2047.0,8501286
47,47,Pacific,Washington,16424.0,5880.0,7523869
48,48,South Atlantic,West Virginia,1021.0,222.0,1804291
49,49,East North Central,Wisconsin,2740.0,2167.0,5807406
50,50,Mountain,Wyoming,434.0,205.0,577601

**(c) Display the number of rows and columns in this DataFrame**

In [21]:
# Type your Q12(c) answer here
homelessness.shape

(51, 6)

**(d) Generate descriptive statistics of the DataFrame's numerical columns**

In [22]:
# Type your Q12(d) answer here
homelessness["individuals"].describe()

count        51.000000
mean       7225.784314
std       15991.025083
min         434.000000
25%        1446.500000
50%        3082.000000
75%        6781.500000
max      109008.000000
Name: individuals, dtype: float64

In [23]:
# Type your Q12(d) answer here
homelessness["family_members"].describe()

count       51.000000
mean      3504.882353
std       7805.411811
min         75.000000
25%        592.000000
50%       1482.000000
75%       3196.000000
max      52070.000000
Name: family_members, dtype: float64

In [24]:
# Type your Q12(d) answer here
homelessness["state_pop"].describe()

count    5.100000e+01
mean     6.405637e+06
std      7.327258e+06
min      5.776010e+05
25%      1.777414e+06
50%      4.461153e+06
75%      7.340946e+06
max      3.946159e+07
Name: state_pop, dtype: float64

**(e) Sort the DataFrame based on the column "individuals" in _ascending_ order and display the Top 5 rows**

In [31]:
# Type your Q12(e) answer here
homelessness.sort_values("individuals").head()

,Unnamed: 0,region,state,individuals,family_members,state_pop
50,50,Mountain,Wyoming,434.0,205.0,577601
34,34,West North Central,North Dakota,467.0,75.0,758080
7,7,South Atlantic,Delaware,708.0,374.0,965479
39,39,New England,Rhode Island,747.0,354.0,1058287
45,45,New England,Vermont,780.0,511.0,624358

**(f) Sort the DataFrame based on the column "individuals" in _descending_ order and display the Top 5 rows**

In [33]:
homelessness.sort_values("individuals",ascending=False).head()

,Unnamed: 0,region,state,individuals,family_members,state_pop
4,4,Pacific,California,109008.0,20964.0,39461588
32,32,Mid-Atlantic,New York,39827.0,52070.0,19530351
9,9,South Atlantic,Florida,21443.0,9587.0,21244317
43,43,West South Central,Texas,19199.0,6111.0,28628666
47,47,Pacific,Washington,16424.0,5880.0,7523869

**(g) Select only the columns "region" and "family_members" and display the top 5 rows**

In [36]:
# Type your Q12(g) answer here
homelessness.loc[:,"region":"family_members"].head()

               region       state  individuals  family_members
0  East South Central     Alabama       2570.0           864.0
1             Pacific      Alaska       1434.0           582.0
2            Mountain     Arizona       7259.0          2606.0
3  West South Central    Arkansas       2280.0           432.0
4             Pacific  California     109008.0         20964.0

**(h) Select the rows which the "region" is "Pacific" and "state" is "California"**

In [40]:
# Question Q12(h)
# Type your answer here
homelessnesss=homelessness[(homelessness['region']=='Pacific') and (homelessness['state']=='California')]
homelessnesss

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [13]:
# Question Q12(h)
# Type your answer here

**(i) Select only the rows where the region is "Pacific" or 'Mountain'.**

In [14]:
# Question Q12(i)
# Type your answer here

**(j) Create a new column known as "indiv_per_10k" col to represent homeless individuals per 10k state pop**

In [15]:
# Question Q12(j)
# Type your answer here

### **Q13 - Aggregating Data with Pivot Tables: Total Sales Analysis by Year, Product, and Region**

**Given a dataset of monthly sales, use pivot_table() to calculate the total annual sales for each product by region. Specifically, group by year, product_name, and region, and aggregate the sales column to obtain the total sales for each unique combination. Provide the Python code and display the resulting DataFrame.**

In [41]:
# Let use the following commannds to generate the Dataframe

import pandas as pd

# Create the sample DataFrame
data = {
    'year': [2022, 2022, 2022, 2022, 2023, 2023, 2023, 2023],
    'month': ['Jan', 'Feb', 'Jan', 'Feb', 'Jan', 'Feb', 'Jan', 'Feb'],
    'product_name': ['Widget A', 'Widget A', 'Widget B', 'Widget B', 'Widget A', 'Widget A', 'Widget B', 'Widget B'],
    'region': ['North', 'North', 'South', 'South', 'North', 'North', 'South', 'South'],
    'sales': [120, 150, 200, 220, 130, 160, 210, 230]
}

# Create DataFrame
sales_df = pd.DataFrame(data)
sales_df

   year month product_name region  sales
0  2022   Jan     Widget A  North    120
1  2022   Feb     Widget A  North    150
2  2022   Jan     Widget B  South    200
3  2022   Feb     Widget B  South    220
4  2023   Jan     Widget A  North    130
5  2023   Feb     Widget A  North    160
6  2023   Jan     Widget B  South    210
7  2023   Feb     Widget B  South    230

In [16]:
# Question 13 - Type your answers here

# Use pivot_table to find total sales per product and region by year


# Display the resulting DataFrame

### **Q14 - E-commerce Order Analysis Using Pandas**

The dataset ecommerce_orders.csv contains daily transaction data for an e-commerce company over a month. Each record includes details of a single transaction. Your task is to analyze the data to help the company understand order patterns, popular products, and revenue trends.

Dataset file: ecommerce_orders.csv

**Dataset Structure:**

- Order_ID: Unique identifier for each order.
- Date: Date of the transaction.
- Product: Product name.
- Category: Category to which the product belongs.
- Quantity: Number of units ordered.
- Unit_Price: Price per unit of the product.

**(a) Load the dataset and display the first five rows. Display the total number of orders, unique products, and categories in the dataset.**

In [43]:
# Question 14(a) - Type your answers here
ecommerce=pd.read_csv('ecommerce_orders.csv')
# Load the data
ecommerce.head()

   Order_ID        Date   Product     Category  Quantity  Unit_Price
0        31  2023-06-01   Monitor  Electronics         4      459.46
1       100  2023-06-02  Keyboard  Electronics         1      888.88
2        28  2023-06-02    Laptop  Electronics         1      298.24
3        89  2023-06-02   Blender   Appliances         3      310.58
4        23  2023-06-02    Laptop  Electronics         2      675.61

In [57]:
# Question 14(a) - Type your answers here

# Display total number of orders, unique products, and categories
total_orders=ecommerce['Order_ID'].count()
unique_products=ecommerce['Product'].unique()
category=ecommerce['Category'].unique()
print(f'''
total orders: {total_orders},
unique products: {unique_products},
category: {category}
''')

total orders: 100,
unique products: ['Monitor' 'Keyboard' 'Laptop' 'Blender' 'Headphones' 'Smartphone'
 'Coffee Maker' 'Air Fryer'],
category: ['Electronics' 'Appliances']

**(b) Create a new column, "Total_Revenue", which is calculated as Quantity * Unit_Price. Display the first five rows of the modified DataFrame.**

In [52]:
# Question 14(b) - Type your answers here

# Create 'Total_Revenue' column
ecommerce["Total Revenue"]=ecommerce["Quantity"]*ecommerce["Unit_Price"]

# Display the first five rows with the new column
ecommerce.head()

,Order_ID,Date,Product,Category,Quantity,Unit_Price,Total Revenue
0,31,2023-06-01,Monitor,Electronics,4,459.46,1837.84
1,100,2023-06-02,Keyboard,Electronics,1,888.88,888.88
2,28,2023-06-02,Laptop,Electronics,1,298.24,298.24
3,89,2023-06-02,Blender,Appliances,3,310.58,931.74
4,23,2023-06-02,Laptop,Electronics,2,675.61,1351.22

**(c) Find all orders where the "Category" is "Electronics" and the "Total_Revenue" is above $2000. Sort these results by "Total_Revenue" in descending order.**

In [20]:
# Question 14(c) - Type your answers here

# Filter for Electronics category with Total_Revenue > $2000


# Sort by 'Total_Revenue' in descending order

**(d) Slice the DataFrame to select only the columns "Date", "Product", "Quantity", and "Total_Revenue" for the first 10 rows**

In [21]:
# Question 14(d) - Type your answers here

# Slice the DataFrame to select specific columns for the first 10 rows

**(e) Using aggregation, calculate the total quantity sold for each product and display the top 5 products with the highest total quantity sold.**

In [22]:
# Question 14(e) - Type your answers here

# Calculate total quantity sold for each product


# Display the top 5 products by quantity sold

**(f) Aggregate the data to calculate the total revenue for each day. Display the results as a new DataFrame, with columns "Date" and "Daily_Revenue".**

In [24]:
# Question 14(f) - Type your answers here

# Aggregate data to calculate total revenue for each day

**Note: This is a challenging question**

**(g) Identify the product with the highest single transaction revenue (i.e., the highest "Total_Revenue" for any one order).**

In [25]:
# Question 14(g) - Type your answers here

# Find the maximum value in 'Total_Revenue' and the corresponding product

### **Note: This is a Challenging Question**

### **Q15 - Retail Sales Analysis Using Pandas Time Series**

### **Use dataset file - retail_sales_june_2023.csv**

**(a) Load the dataset and set the "Date" column as the index of the DataFrame, ensuring that it is in datetime format.**

In [51]:
# Question 15(a) - Type your answers here

# Load the data
retail=pd.read_csv('retail_sales_june_2023.csv')
retail.head()
# Convert 'Date' to datetime and set as index
pd.to_datetime(retail['Date'])
retail.set_index(retail['Date'])
retail.head()

         Date  Sales
0  2023-06-01    437
1  2023-06-02    635
2  2023-06-03    796
3  2023-06-04    472
4  2023-06-05    655

**(b) Calculate the total and average daily sales for June. Display the average rounded to one decimal place.**

In [26]:
# Question 15(b) - Type your answers here

# Calculate total and average daily sales for June

**(c) Identify the day with the highest sales and the day with the lowest sales. Also, calculate the difference in sales units between these two days.**

In [28]:
# Question 15(c) - Type your answers here

# Find the days with highest and lowest sales

**(d) Compute a 7-day moving average for daily sales and add it as a new column, "7_day_MA"**

In [29]:
# Question 15(d) - Type your answers here

# Calculate 7-day moving average and add as a new column

**(e) Resample the data on a weekly basis, calculating the total sales for each week. Display the results in a table format**

In [ ]:
# Question 15(e) - Type your answers here

# Resample data weekly to get total sales for each week


# Display the weekly totals in a table format

**(f) Identify any days where sales dropped by 20% or more compared to the previous day and list the dates and sales values for these occurrences**

In [31]:
# Question 15(f) - Type your answers here

# Calculate the percentage change in sales from the previous day


# Find days where sales dropped by 20% or more